## Part 1: Explore the Data

Import the data and use Pandas to learn more about the dataset.

In [708]:
import pandas as pd

df = pd.read_csv(client_dataset.csv')

df.head()

,first,last,job,phone,email,client_id,order_id,order_date,order_week,order_year,item_id,category,subcategory,unit_price,unit_cost,unit_weight,qty,line_number
0,Donald,Harding,Immunologist,793-904-7725x39308,harding.donald.7185@sullivan.com,58515,8953482,2023-04-28,17,2023,EUD29711-63-6U,decor,wall art,1096.80,762.71,7.50,105,1
1,Tiffany,Myers,Music therapist,201.442.4543x942,myers.t.6537@ferguson-johnson.net,37609,8069089,2023-05-19,20,2023,XDA18116-89-4A,consumables,pens,24.95,15.09,1.49,21,0
2,Shannon,Watson,Immunologist,687.737.9424x8503,swatson8146@payne.net,57113,1902144,2023-01-29,4,2023,ABE59463-05-7E,software,project management,13.52,7.86,1.68,39,6
3,Nathan,Baker,Accounting technician,827-788-8123x012,bakernathan@benson.com,46554,9031802,2023-04-25,17,2023,ZMM00836-65-0C,consumables,pens,36.42,24.85,1.23,29,3
4,Christina,Schwartz,Chiropractor,265-829-3643,christinaschwartz9252@mcconnell.com,92089,1322274,2023-05-28,21,2023,BZX55559-12-3X,consumables,misc,195.10,108.17,46.43,20,1

In [709]:
# View the column names in the data
print(df.columns)

Index(['first', 'last', 'job', 'phone', 'email', 'client_id', 'order_id',
       'order_date', 'order_week', 'order_year', 'item_id', 'category',
       'subcategory', 'unit_price', 'unit_cost', 'unit_weight', 'qty',
       'line_number'],
      dtype='object')

In [710]:
# Use this space to do any additional research
# and familiarize yourself with the data.

In [711]:
df.describe()

,client_id,order_id,order_week,order_year,unit_price,unit_cost,unit_weight,qty,line_number
count,54639.000000,5.463900e+04,54639.000000,54639.000000,54639.000000,54639.000000,54639.000000,5.463900e+04,54639.000000
mean,54837.869416,5.470190e+06,11.359139,2022.993064,136.267207,99.446073,5.004116,5.702646e+02,2.979667
std,25487.438231,2.599807e+06,7.023499,0.082997,183.873135,133.164267,5.326599,1.879552e+04,2.436320
min,10033.000000,1.000886e+06,1.000000,2022.000000,0.010000,0.010000,0.000000,0.000000e+00,0.000000
25%,33593.000000,3.196372e+06,6.000000,2023.000000,20.800000,14.840000,1.450000,3.200000e+01,1.000000
50%,53305.000000,5.496966e+06,11.000000,2023.000000,68.310000,49.890000,3.240000,6.800000e+01,3.000000
75%,78498.000000,7.733869e+06,17.000000,2023.000000,173.160000,125.570000,6.890000,1.700000e+02,5.000000
max,99984.000000,9.998480e+06,52.000000,2023.000000,1396.230000,846.270000,46.430000,3.958244e+06,9.000000

In [712]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 54639 entries, 0 to 54638
Data columns (total 18 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   first        54639 non-null  object
 1   last         54639 non-null  object
 2   job          54639 non-null  object
 3   phone        54639 non-null  object
 4   email        54639 non-null  object
 5   client_id    54639 non-null  int64
 6   order_id     54639 non-null  int64
 7   order_date   54639 non-null  object
 8   order_week   54639 non-null  int64
 9   order_year   54639 non-null  int64
 10  item_id      54639 non-null  object
 11  category     54639 non-null  object
 12  subcategory  54639 non-null  object
 13  unit_price   54639 non-null  float64
 14  unit_cost    54639 non-null  float64
 15  unit_weight  54639 non-null  float64
 16  qty          54639 non-null  int64
 17  line_number  54639 non-null  int64
dtypes: float64(3), int64(6), object(9)
memory usage: 7.5+ MB

In [713]:
df.dtypes

first           object
last            object
job             object
phone           object
email           object
client_id        int64
order_id         int64
order_date      object
order_week       int64
order_year       int64
item_id         object
category        object
subcategory     object
unit_price     float64
unit_cost      float64
unit_weight    float64
qty              int64
line_number      int64
dtype: object

In [714]:
df.client_id.value_counts()

client_id
33615    220
66037    211
46820    209
38378    207
24741    207
        ...
70734      4
32001      4
77583      3
76017      3
94987      1
Name: count, Length: 999, dtype: int64

In [715]:
df.unit_cost.mean()

99.4460727685353

In [716]:
map_df = df.groupby('client_id').agg({'unit_cost': 'mean'})
map_df

            unit_cost
client_id
10033      135.644737
10091       51.322143
10218       80.323214
10351       87.309000
10435       82.391538
...               ...
99400       98.532609
99450       70.372174
99736       88.659000
99973       92.408000
99984      105.244545

[999 rows x 1 columns]

In [717]:
# What three item categories had the most entries?
top_three_categories = df['category'].value_counts().nlargest(3)
# Convert the series to a dataframe
top_three_categories_df = top_three_categories.reset_index()

# Rename the columns
top_three_categories_df.columns = ['Category', 'Count']

# Print the dataframe
print("The top three categories are:")
print(top_three_categories_df.to_string(index=False))

The top three categories are:
   Category  Count
consumables  23538
  furniture  11915
   software   8400

In [718]:
# For the consumables,which subcategory had the most entries?
consumables_df = df[df['category'] == 'consumables']
most_entries_subcategory = consumables_df['subcategory'].value_counts().nlargest(1)
print(f'The subcategory with the most entries is:') 
most_entries_subcategory

The subcategory with the most entries is:

subcategory
bathroom supplies    6424
Name: count, dtype: int64

In [719]:
# Which five clients had the most entries in the data?
top_five_clients = df['client_id'].value_counts().nlargest(5)   
print("The top five clients are:")
top_five_clients

The top five clients are:

client_id
33615    220
66037    211
46820    209
38378    207
24741    207
Name: count, dtype: int64

In [720]:
# Store the client ids of those top 5 clients in a list.
top_five_client_ids  = top_five_clients.index.tolist()
top_five_client_ids

[33615, 66037, 46820, 38378, 24741]

In [721]:
# How many total units (the qty column) did the client  with the most entries order?
total_units_client_33615 = df[df['client_id'] == 33615]['qty'].sum()
print(f'Client 33615 was the top client with orderers totaling {total_units_client_33615} units.')

Client 33615 was the top client with orderers totaling 64313 units.

## Part 2: Transform the Data
Do we know that this client spent the more money than client 66037? If not, how would we find out? Transform the data using the steps below to prepare it for analysis.

In [732]:
# Create a column that calculates the subtotal for each line using the unit_price and the qty
# create a new column for client 33615 that calculates the subtotal for each line using the unit_price * the qty and then display the first 5 rows of the data.

df['line_subtotal'] = (df['unit_price'] * df['qty'])
print(df[['unit_price', 'qty', 'line_subtotal']].head())

   unit_price  qty  line_subtotal
0     1096.80  105      115164.00
1       24.95   21         523.95
2       13.52   39         527.28
3       36.42   29        1056.18
4      195.10   20        3902.00

In [724]:
# Create a column for shipping price.  Assume a shipping price of $7 per pound for orders over 50 pounds and $10 per pound for items 50 pounds or under.
def calculate_shipping_price(row):
    shipping_weight = row['unit_weight'] * row['qty']
    if shipping_weight > 50:
        return shipping_weight * 7
    else:
        return shipping_weight * 10
df['shipping_weight'] = df['unit_weight'] * df['qty']
df['shipping_price'] = df.apply(calculate_shipping_price, axis=1)
print(df[['unit_price', 'unit_weight', 'qty', 'shipping_weight', 'shipping_price']].head())

   unit_price  unit_weight  qty  shipping_weight  shipping_price
0     1096.80         7.50  105           787.50         5512.50
1       24.95         1.49   21            31.29          312.90
2       13.52         1.68   39            65.52          458.64
3       36.42         1.23   29            35.67          356.70
4      195.10        46.43   20           928.60         6500.20

In [725]:
# Create a column for the total price, using the subtotal and the shipping price, along with a sales tax of 9.25%
df['sales_tax_rate'] = sales_tax_rate = 0.0925
df['total_price'] = ((df['line_subtotal'] + df['shipping_price']) * (1 + df['sales_tax_rate'])).round(2)

print(df[['line_subtotal', 'shipping_price', 'line_subtotal', 'total_price']].head())

   line_subtotal  shipping_price  line_subtotal  total_price
0      115164.00         5512.50      115164.00    131839.08
1         523.95          312.90         523.95       914.26
2         527.28          458.64         527.28      1077.12
3        1056.18          356.70        1056.18      1543.57
4        3902.00         6500.20        3902.00     11364.40

In [726]:
# Create a column for the cost of each line using unit cost, qty, and shipping price (assume the shipping cost is exactly what is charged to the client).
df['line_cost'] = df['unit_cost'] * df['qty'] + df['shipping_price'] 

print(df[['unit_cost', 'qty', 'shipping_price', 'line_cost']].head())

   unit_cost  qty  shipping_price  line_cost
0     762.71  105         5512.50   85597.05
1      15.09   21          312.90     629.79
2       7.86   39          458.64     765.18
3      24.85   29          356.70    1077.35
4     108.17   20         6500.20    8663.60

In [727]:
# Create a column for the profit of
# each line using line cost and line price
# Create a column for the profit of each line using line cost and line price
df['line_profit'] = df['total_price'] - df['line_cost']
print(df[['total_price', 'line_cost', 'line_profit']].head())

   total_price  line_cost  line_profit
0    131839.08   85597.05     46242.03
1       914.26     629.79       284.47
2      1077.12     765.18       311.94
3      1543.57    1077.35       466.22
4     11364.40    8663.60      2700.80

## Part 3: Confirm your work
You have email receipts showing that the total prices for 3 orders. Confirm that your calculations match the receipts. Remember, each order has multiple lines.

Order ID 2742071 had a total price of \$152,811.89

Order ID 2173913 had a total price of \$162,388.71

Order ID 6128929 had a total price of \$923,441.25

In [728]:
# Check your work using the totals above
order_ids = [2742071, 2173913, 6128929]
total_prices = []
for order_id in order_ids:
    total_price = df.loc[df['order_id'] == order_id, 'total_price'].sum()
    total_prices.append(total_price)  # Store the total price for grand total calculation
    print(f"Total invoiced amount for Order ID {order_id}: ${'{:,.3f}'.format(total_price)}") 

print(f"The total invoiced amounts match the receipt totals, confirming my work.")

Total invoiced amount for Order ID 2742071: $152,811.890
Total invoiced amount for Order ID 2173913: $162,388.710
Total invoiced amount for Order ID 6128929: $923,441.250
The total invoiced amounts match the receipt totals, confirming my work.

## Part 4: Summarize and Analyze
Use the new columns with confirmed values to find the following information.

In [729]:
# How much did each of the top 5 clients by quantity spend? Check your work from Part 1 for client ids.
# Top five client IDs
top_five_client_ids = [33615, 66037, 46820, 38378, 24741]

# Create an empty dictionary to store total spend for each client
total_spend_top_five_clients = {}

# Calculate total spend for each client
for client_id in top_five_client_ids:
    total_invoiced = df[df['client_id'] == client_id]['total_price'].sum().round(2)
    total_spend_top_five_clients[client_id] = total_invoiced

# Print total spend for each client
for client_id, total_invoiced in total_spend_top_five_clients.items():
      print(f"Client ID: {client_id}, Total invoiced: ${total_invoiced:,.2f}")    # Sort the top_five_clients series in ascending order

Client ID: 33615, Total invoiced: $8,377,308.52
Client ID: 66037, Total invoiced: $10,259,514.79
Client ID: 46820, Total invoiced: $9,743,794.36
Client ID: 38378, Total invoiced: $12,906,550.87
Client ID: 24741, Total invoiced: $82,268,892.02

In [730]:
# Create a summary DataFrame showing the totals for the for the top 5 clients with the following information: 
# total units purchased, 
# total shipping price, 
# total revenue, and 
# total profit. 
# Sort by total profit.

top_five_clients_df = df[df['client_id'].isin(top_five_client_ids)]

# Calculate summary statistics
summary_df = top_five_clients_df.groupby('client_id').agg({
    'qty': 'sum',  
    'shipping_price': 'sum',
    'total_price': 'sum',
    'line_cost': 'sum',
    'line_profit': 'sum',
})

# Sort by total profit descending
summary_df = summary_df.sort_values(by='line_profit', ascending=False)

print(summary_df)

              qty  shipping_price  total_price    line_cost  line_profit
client_id
24741      239862      5126448.37  82268892.02  45688899.71  36579992.31
38378       73667      3429455.40  12906550.87   9634720.98   3271829.89
66037       43018      1395151.85  10259514.79   7004482.98   3255031.81
46820       75768      1601448.84   9743794.36   7007191.64   2736602.72
33615       64313      1828984.89   8377308.52   6175313.91   2201994.61

In [731]:
# Format the data and rename the columns
# to names suitable for presentation.
# Currency should be in millions of dollars.

summary_df = summary_df.rename(columns={
     'client_id': 'Client ID',
     'qty': 'Total Quantity',
     'shipping_price': 'Total Shipping Price',
     'total_price': 'Total Invoiced',
     'line_cost': 'Total Cost',
     'line_profit': 'Total Profit'})
     
 
currency_columns = ['Total Shipping Price', 'Total Invoiced', 'Total Cost', 'Total Profit']
for column in currency_columns:
     summary_df[column] = summary_df[column] / 1000000  # Convert to millions
     summary_df[column] = summary_df[column].map('${:,.2f}M'.format)  # Format as string with $ sign and M for million

# Sort the updated data by "Total Profit" form highest to lowest
summary_df

,Total Quantity,Total Shipping Price,Total Invoiced,Total Cost,Total Profit
client_id,,,,,
24741,239862,$5.13M,$82.27M,$45.69M,$36.58M
38378,73667,$3.43M,$12.91M,$9.63M,$3.27M
66037,43018,$1.40M,$10.26M,$7.00M,$3.26M
46820,75768,$1.60M,$9.74M,$7.01M,$2.74M
33615,64313,$1.83M,$8.38M,$6.18M,$2.20M